[
  "قَالُواْ أَضْغَٰثُ أَحْلَٰمٖۖ وَمَا نَحْنُ بِتَأْوِيلِ اِ۬لْأَحْلَٰمِ بِعَٰلِمِينَۖ (44)",
  "وَقَالَ اَ۬لذِے نَجَا مِنْهُمَا وَادَّكَرَ بَعْدَ أُمَّةٍ أَنَا أُنَبِّئُكُم بِتَأْوِيلِهِۦ",
  "فَأَرْسِلُونِۖ (45) يُوسُفُ أَيُّهَا اَ۬لصِّدِّيقُ أَفْتِنَا فِے سَبْعِ بَقَرَٰتٖ",
  "سِمَانٖ يَأْكُلُهُنَّ سَبْعٌ عِجَافٞ وَسَبْعِ سُنۢبُلَٰتٍ خُضْرٖ",
  "وَأُخَرَ يَابِسَٰتٖ لَّعَلِّيَ أَرْجِعُ إِلَي اَ۬لنَّاسِ لَعَلَّهُمْ يَعْلَمُونَۖ (46) قَالَ",
  "تَزْرَعُونَ سَبْعَ سِنِينَ دَأْباٗ فَمَا حَصَدتُّمْ فَذَرُوهُ فِے سُنۢبُلِهِۦ إِلَّا",
  "قَلِيلاٗ مِّمَّا تَأْكُلُونَۖ (47) ثُمَّ يَأْتِے مِنۢ بَعْدِ ذَٰلِكَ سَبْعٞ شِدَادٞ يَأْكُلْنَ",
  "مَا قَدَّمْتُمْ لَهُنَّ إِلَّا قَلِيلاٗ مِّمَّا تُحْصِنُونَۖ (48) ثُمَّ يَأْتِے مِنۢ بَعْدِ ذَٰلِكَ",
  "عَامٞ فِيهِ يُغَاثُ اُ۬لنَّاسُ وَفِيهِ يَعْصِرُونَۖ (49) وَقَالَ اَ۬لْمَلِكُ اُ۪ئْتُونِے",
  "بِهِۦۖ فَلَمَّا جَآءَهُ اُ۬لرَّسُولُ قَالَ اَ۪رْجِعْ إِلَيٰ رَبِّكَ فَسْـَٔلْهُ مَا بَالُ",
  "اُ۬لنِّسْوَةِ اِ۬لَّٰتِے قَطَّعْنَ أَيْدِيَهُنَّۖ إِنَّ رَبِّے بِكَيْدِهِنَّ عَلِيمٞۖ (50)",
  "قَالَ مَا خَطْبُكُنَّ إِذْ رَٰوَدتُّنَّ يُوسُفَ عَن نَّفْسِهِۦۖ قُلْنَ حَٰشَ",
  "لِلهِ مَا عَلِمْنَا عَلَيْهِ مِن سُوٓءٖۖ قَالَتِ اِ۪مْرَأَتُ اُ۬لْعَزِيزِ اِ۬ءَلْٰنَ حَصْحَصَ",
  "اَ۬لْحَقُّ أَنَا رَٰوَدتُّهُۥ عَن نَّفْسِهِۦ وَإِنَّهُۥ لَمِنَ اَ۬لصَّٰدِقِينَۖ (51) ذَٰلِكَ",
  "لِيَعْلَمَ أَنِّے لَمْ أَخُنْهُ بِالْغَيْبِ وَأَنَّ اَ۬للَّهَ لَا يَهْدِے كَيْدَ اَ۬لْخَآئِنِينَۖ (52)",
  "۞وَمَا أُبَرِّۓُ نَفْسِيَۖ إِنَّ اَ۬لنَّفْسَ لَأَمَّارَةُۢ بِالسُّوِّ إِلَّا مَا رَحِمَ رَبِّيَۖ",
  "إِنَّ رَبِّے غَفُورٞ رَّحِيمٞۖ (53) وَقَالَ اَ۬لْمَلِكُ اُ۪ئْتُونِے بِهِۦ أَسْتَخْلِصْهُ",
  "لِنَفْسِےۖ فَلَمَّا كَلَّمَهُۥ قَالَ إِنَّكَ اَ۬لْيَوْمَ لَدَيْنَا مَكِينٌ أَمِينٞۖ (54)",
  "قَالَ اَ۪جْعَلْنِے عَلَيٰ خَزَآئِنِ اِ۬لْأَرْضِ إِنِّے حَفِيظٌ عَلِيمٞ (55) وَكَذَٰلِكَ",
  "مَكَّنَّا لِيُوسُفَ فِے اِ۬لْأَرْضِ يَتَبَوَّأُ مِنْهَا حَيْثُ يَشَآءُۖ نُصِيبُ",
  "بِرَحْمَتِنَا مَن نَّشَآءُ وَلَا نُضِيعُ أَجْرَ اَ۬لْمُحْسِنِينَۖ (56) وَلَأَجْرُ",
  "اُ۬لْأٓخِرَةِ خَيْرٞ لِّلذِينَ ءَامَنُواْ وَكَانُواْ يَتَّقُونَۖ (57) وَجَآءَ",
  "ا۪خْوَةُ يُوسُفَ فَدَخَلُواْ عَلَيْهِ فَعَرَفَهُمْ وَهُمْ لَهُۥ مُنكِرُونَۖ",
  "(58) وَلَمَّا جَهَّزَهُم بِجَهَازِهِمْ قَالَ اَ۪ئْتُونِے بِأَخٖ لَّكُم مِّنْ أَبِيكُمْۖ أَلَا",
  "تَرَوْنَ أَنِّيَ أُوفِے اِ۬لْكَيْلَ وَأَنَا خَيْرُ اُ۬لْمُنزِلِينَۖ (59) فَإِن لَّمْ تَأْتُونِے",
  "بِهِۦ فَلَا كَيْلَ لَكُمْ عِندِے وَلَا تَقْرَبُونِۖ (60) قَالُواْ سَنُرَٰوِدُ عَنْهُ أَبَاهُ",
  "وَإِنَّا لَفَٰعِلُونَۖ (61) وَقَالَ لِفِتْيَتِهِ اِ۪جْعَلُواْ بِضَٰعَتَهُمْ فِے رِحَالِهِمْ",
  "لَعَلَّهُمْ يَعْرِفُونَهَا إِذَا اَ۪نقَلَبُواْ إِلَيٰ أَهْلِهِمْ لَعَلَّهُمْ يَرْجِعُونَۖ",
  "(62) فَلَمَّا رَجَعُواْ إِلَيٰ أَبِيهِمْ قَالُواْ يَٰأَبَانَا مُنِعَ مِنَّا اَ۬لْكَيْلُ",
  "فَأَرْسِلْ مَعَنَا أَخَانَا نَكْتَلْ وَإِنَّا لَهُۥ لَحَٰفِظُونَۖ (63)"
]