export const source = [
    {
        type: "BASMALA",
        value: "بِسْمِ اللَّـهِ الرَّحْمَـٰنِ الرَّحِيمِ",
        page: 1,
    },
    {
        type: "AYAH",
        value: `الْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ ⭐ الرَّحْمَٰنِ`,
        page: 1,
    },
    {
        type: "AYAH",
        value: `الرَّحِيمِ ⭐ مَالِكِ يَوْمِ الدِّينِ ⭐`,
        page: 1,
    },

    {
        type: "AYAH",
        value: `إِيَّاكَ نَعْبُدُ وَإِيَّاكَ نَسْتَعِينُ ⭐`,
        page: 1,
    },

    {
        type: "AYAH",
        value: `اهْدِنَا الصِّرَاطَ الْمُسْتَقِيمَ ⭐ صِرَاطَ`,
        page: 1,
    },

    {
        type: "AYAH",
        value: `الَّذِينَ أَنْعَمْتَ عَلَيْهِمْ ⭐ غَيْرِ`,
        page: 1,
    },
    {
        type: "AYAH",
        value: `الْمَغْضُوبِ عَلَيْهِمْ وَلَا الضَّالِّينَ ⭐`,
        page: 1,
    },



    {
        type: "BASMALA",
        value: "بِسْمِ اللَّـهِ الرَّحْمَـٰنِ الرَّحِيمِ",
        page: 2,
    },
    {
        type: "AYAH",
        value: `أَلَٓمِّٓۖ ذَٰلِكَ اَ۬لْكِتَٰبُ لَا رَيْبَۖ فِيهِ هُديٗ`,
        page: 2,
    },
    {
        type: "AYAH",
        value: "لِّلْمُتَّقِينَ ⭐ اَ۬لَّذِينَ يُؤْمِنُونَ بِالْغَيْبِ وَيُقِيمُونَ",
        page: 2,
    },
    {
        type: "AYAH",
        value: "اَ۬لصَّلَوٰةَ وَمِمَّا رَزَقْنَٰهُمْ يُنفِقُونَۖ ⭐ ",
        page: 2,
    },
    {
        type: "AYAH",
        value: "وَالذِينَ يُؤْمِنُونَ بِمَا أُنزِلَ إِلَيْكَ وَمَا أُنزِلَ مِن",
        page: 2,
    },
    {
        type: "AYAH",
        value: "قَبْلِكَ وَبِالْأٓخِرَةِ هُمْ يُوقِنُونَ ⭐ أُوْلَٰئِكَ عَلَيٰ",
        page: 2,
    },
    {
        type: "AYAH",
        value: "هُديٗ مِّن رَّبِّهِمْۖ وَأُوْلَٰئِكَ هُمُ اُ۬لْمُفْلِحُونَۖ ⭐ ",
        page: 2,
    }
]